Delans-TLE/src/Catalogs/ВетеринарноСопроводительныйДокументВЕТИС/ВетеринарноСопроводительныйДокументВЕТИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВетеринарноСопроводительныйДокументВЕТИС</name>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияБланкаСтрогойОтчетности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерБланкаСтрогойОтчетности</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Форма</name>
    <type>
      <types>EnumRef.ФормыВетеринарныхДокументовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыВетеринарныхДокументовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВетеринарныхДокументовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузоотправительПредприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательПредприятие</name>
    <type>
      <types>CatalogRef.ПредприятияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеревозчикХозяйствующийСубъект</name>
    <type>
      <types>CatalogRef.ХозяйствующиеСубъектыВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.ПродукцияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЕТИС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияВЕТИС</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмеренияВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СкоропортящаясяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НизкокачественнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособХранения</name>
    <type>
      <types>EnumRef.СпособыХраненияПриТранспортировкеВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспертизаВыполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭкспертизаРезультат</name>
    <type>
      <types>EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>БлагополучиеМестности</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>CatalogRef.ЦелиВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеОтметки</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодНахожденияЖивотныхНаТерриторииТС</name>
    <type>
      <types>EnumRef.ПериодыНахожденияЖивотныхНаТерриторииТСВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовНахожденияЖивотныхНаТерриторииТС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяЗагрузка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводстваСтрока</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводстваТочностьЗаполнения</name>
    <type>
      <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводстваНачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроизводстваКонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиСтрока</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиТочностьЗаполнения</name>
    <type>
      <types>EnumRef.ТочностьЗаполненияПериодаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиНачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодностиКонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияТТН</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТТН</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТТН</name>
    <type>
      <types>DefinedType.СтрокаВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТТН</name>
    <type>
      <types>EnumRef.ТипыДокументовВЕТИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроизводства</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроисхождения</name>
    <type>
      <types>EnumRef.ТипыПроисхожденияНепищевойПродукцииВЕТИС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УпаковкиВЕТИС</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УровеньУпаковки</name>
      <type>
        <types>EnumRef.УровниУпаковокВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаВЕТИС</name>
      <type>
        <types>CatalogRef.УпаковкиВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокВЕТИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМаркировки</name>
      <type>
        <types>EnumRef.ТипыМаркировкиУпаковокВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Производители</name>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>РольПредприятия</name>
      <type>
        <types>EnumRef.РолиПредприятийВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроизводственныеПартии</name>
    <attributes>
      <name>ИдентификаторПартии</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршрут</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>DefinedType.УникальныйИдентификаторВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Предприятие</name>
      <type>
        <types>CatalogRef.ПредприятияВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресПредставление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеАдреса</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>СПерегрузкой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТранспорта</name>
      <type>
        <types>EnumRef.ТипыТранспортаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТранспортногоСредства</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАвтомобильногоПрицепа</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАвтомобильногоКонтейнера</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеДокументы</name>
    <attributes>
      <name>ТипДокумента</name>
      <type>
        <types>EnumRef.ТипыДокументовВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЛабораторныеИсследования</name>
    <attributes>
      <name>НомерАктаОтбораПроб</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОтбораПроб</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЛаборатории</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоказателя</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПолученияРезультата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МетодИсследования</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерЭкспертизы</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Заключение</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатИсследования</name>
      <type>
        <types>EnumRef.РезультатыЛабораторныхИсследованийВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Иммунизация</name>
    <attributes>
      <name>ТипИммунизации</name>
      <type>
        <types>EnumRef.ТипыИммунизацииВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеБолезниПаразита</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроведенияИммунизацииОбработки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НазваниеИПроизводительВакциныПрепарата</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСерииВакциныПрепарата</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДействияВакциныПрепарата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>ДатаИзменения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыВетеринарныхДокументовВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИО</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеОрганизации</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.СтрокаВЕТИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Delans-TLE/src/Catalogs/ВетеринарноСопроводительныйДокументВЕТИС/Forms/ЗагрузкаИдентификаторовВСДИзВнешнихФайлов/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ИнициализироватьТабличныйДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Закрыть(Идентификаторы());
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	Макет = Справочники.ВетеринарноСопроводительныйДокументВЕТИС.ПолучитьМакет("ЗагрузкаИдентификаторовВСДИзВнешнихФайлов");
	
	ТабличныйДокумент.Очистить();
	
	ОбластьТовар = Макет.ПолучитьОбласть("КодыВСД");
	ТабличныйДокумент.Присоединить(ОбластьТовар);
	
	ТабличныйДокумент.ФиксацияСверху = 1;
	
КонецПроцедуры

&НаСервере
Функция Идентификаторы()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Идентификатор", Метаданные.ОпределяемыеТипы.УникальныйИдентификаторВЕТИС.Тип);
	
	КоличествоСтрок = ТабличныйДокумент.ВысотаТаблицы;
	
	Для НомерСтроки = 2 По КоличествоСтрок Цикл
		
		Идентификатор = СокрЛП(ТабличныйДокумент.Область("R" + НомерСтроки + "C2").Текст);
		
		Если СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(Идентификатор) Тогда
			
			НоваяСтрока = Таблица.Добавить();
			НоваяСтрока.Идентификатор = Идентификатор;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Таблица.ВыгрузитьКолонку("Идентификатор");
	
КонецФункции

#КонецОбласти
